IdeaRS.OpenModel.Geometry2D.PolyLine2D
Represents a polyline in two-dimensional space.

IdeaRS.OpenModel.Geometry2D.PolyLine2D.#ctor
Constructor

IdeaRS.OpenModel.Geometry2D.PolyLine2D.StartPoint
Gets or sets the point where the PolyLine2D begins.

IdeaRS.OpenModel.Geometry2D.PolyLine2D.Segments
Gets segments of PolyLine2D.